[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=31
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=59
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=28
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=59
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=127
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=55
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=235
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=123
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=39
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=120
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=23
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=27
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=495
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=235
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=246
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=244
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=241
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=245
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=137
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=86
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=79
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=495
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=902
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=485
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=902
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=476
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=902
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=434
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=902
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=483
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=902
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=311
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=572
activation=leaky

[convolutional]
batch_normalize=1
filters=278
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=454
activation=leaky

[convolutional]
batch_normalize=1
filters=274
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=386
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[9, 10, 11]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[-1, 61]

[convolutional]
batch_normalize=1
filters=126
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=224
activation=leaky

[convolutional]
batch_normalize=1
filters=145
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=222
activation=leaky

[convolutional]
batch_normalize=1
filters=143
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=283
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[6, 7, 8]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[-1, -4, 36]

[convolutional]
batch_normalize=1
filters=65
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=135
activation=leaky

[convolutional]
batch_normalize=1
filters=74
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=129
activation=leaky

[convolutional]
batch_normalize=1
filters=77
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=162
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[3, 4, 5]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,320
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[91]

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=8

[route]
layers=[-1, -4, -7, 11]

[convolutional]
batch_normalize=1
filters=58
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=96
activation=leaky

[convolutional]
batch_normalize=1
filters=46
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=76
activation=leaky

[convolutional]
batch_normalize=1
filters=39
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=84
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[0, 1, 2]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

