[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=29
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=58
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=28
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=58
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=123
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=123
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=123
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=218
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=6
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=218
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=5
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=218
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=22
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=218
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=18
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=218
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=218
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=218
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=218
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=208
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=10
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=208
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=208
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=96
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=94
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=46
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=58
activation=leaky

[convolutional]
batch_normalize=1
filters=49
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=69
activation=leaky

[convolutional]
batch_normalize=1
filters=55
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=131
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[9, 10, 11]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[-1, 40]

[convolutional]
batch_normalize=1
filters=76
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=97
activation=leaky

[convolutional]
batch_normalize=1
filters=77
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=101
activation=leaky

[convolutional]
batch_normalize=1
filters=92
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=140
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[6, 7, 8]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[49]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[-1, -4, 33]

[convolutional]
batch_normalize=1
filters=74
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=104
activation=leaky

[convolutional]
batch_normalize=1
filters=68
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=95
activation=leaky

[convolutional]
batch_normalize=1
filters=65
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=93
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[3, 4, 5]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,320
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[61]

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[49]

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=8

[route]
layers=[-1, -4, -7, 11]

[convolutional]
batch_normalize=1
filters=60
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=97
activation=leaky

[convolutional]
batch_normalize=1
filters=51
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=74
activation=leaky

[convolutional]
batch_normalize=1
filters=31
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=49
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[0, 1, 2]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

