[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=31
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=61
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=28
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=61
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=127
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=26
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=55
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=241
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=123
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=49
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=122
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=29
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=29
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=36
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=62
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=241
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=504
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=239
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=246
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=245
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=243
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=246
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=147
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=103
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=99
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=504
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=957
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=490
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=957
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=480
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=957
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=447
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=957
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=486
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=957
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=342
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=622
activation=leaky

[convolutional]
batch_normalize=1
filters=301
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
batch_normalize=1
filters=304
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=461
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[9, 10, 11]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[-1, 61]

[convolutional]
batch_normalize=1
filters=136
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=246
activation=leaky

[convolutional]
batch_normalize=1
filters=157
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=236
activation=leaky

[convolutional]
batch_normalize=1
filters=159
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=326
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[6, 7, 8]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[-1, -4, 36]

[convolutional]
batch_normalize=1
filters=68
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=150
activation=leaky

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=142
activation=leaky

[convolutional]
batch_normalize=1
filters=83
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=182
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[3, 4, 5]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,320
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[91]

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=8

[route]
layers=[-1, -4, -7, 11]

[convolutional]
batch_normalize=1
filters=58
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=97
activation=leaky

[convolutional]
batch_normalize=1
filters=47
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=80
activation=leaky

[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=91
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[0, 1, 2]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

