[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=127
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=43
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=61
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=252
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=100
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=22
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=23
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=36
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=37
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=56
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=44
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=94
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=252
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=502
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=240
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=129
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=237
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=247
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=248
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=250
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=67
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=89
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=502
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=714
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=485
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=714
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=480
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=714
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=391
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=714
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=492
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=714
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=319
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=497
activation=leaky

[convolutional]
batch_normalize=1
filters=260
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=436
activation=leaky

[convolutional]
batch_normalize=1
filters=257
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=463
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[9, 10, 11]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[-1, 61]

[convolutional]
batch_normalize=1
filters=153
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=278
activation=leaky

[convolutional]
batch_normalize=1
filters=173
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=254
activation=leaky

[convolutional]
batch_normalize=1
filters=165
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=314
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[6, 7, 8]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[-1, -4, 36]

[convolutional]
batch_normalize=1
filters=84
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=164
activation=leaky

[convolutional]
batch_normalize=1
filters=94
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=160
activation=leaky

[convolutional]
batch_normalize=1
filters=95
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=179
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[3, 4, 5]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,320
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[91]

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=8

[route]
layers=[-1, -4, -7, 11]

[convolutional]
batch_normalize=1
filters=61
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=108
activation=leaky

[convolutional]
batch_normalize=1
filters=54
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=97
activation=leaky

[convolutional]
batch_normalize=1
filters=39
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=95
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[0, 1, 2]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

