[net]
batch=16
subdivisions=1
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.001
burn_in=1000
max_batches=500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=30
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=61
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=61
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=127
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=35
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=53
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=127
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=228
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=75
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=8
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=6
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=20
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=39
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=228
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=349
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=209
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=38
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=209
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=224
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=221
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=230
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=11
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=15
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=349
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=236
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=434
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=236
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=439
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=236
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=263
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=236
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=457
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=236
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=[-3]
activation=linear

[convolutional]
batch_normalize=1
filters=144
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=154
activation=leaky

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=149
activation=leaky

[convolutional]
batch_normalize=1
filters=122
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=207
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[9, 10, 11]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[-1, 61]

[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=153
activation=leaky

[convolutional]
batch_normalize=1
filters=114
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=143
activation=leaky

[convolutional]
batch_normalize=1
filters=115
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=213
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[6, 7, 8]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[-1, -4, 36]

[convolutional]
batch_normalize=1
filters=75
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=118
activation=leaky

[convolutional]
batch_normalize=1
filters=74
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=115
activation=leaky

[convolutional]
batch_normalize=1
filters=84
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=128
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[3, 4, 5]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,320
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

[route]
layers=[-4]

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers=[91]

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=4

[route]
layers=[79]

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=8

[route]
layers=[-1, -4, -7, 11]

[convolutional]
batch_normalize=1
filters=60
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=101
activation=leaky

[convolutional]
batch_normalize=1
filters=52
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=79
activation=leaky

[convolutional]
batch_normalize=1
filters=33
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=71
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=45
activation=linear

[yolo]
mask=[0, 1, 2]
anchors=5,10, 9,23, 17,41, 37,32, 30,61, 62,45, 59,119, 97,134, 65,65, 116,90, 156,198, 373,326
classes=10
num=12
jitter=.3
ignore_thresh=.7
truth_thresh=1
random=1

